Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** \\brief  1040, MAC Address High Register */
#define ETH_MAC_ADDRESS_G00_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E040u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G00_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G00_HIGH.
 */
#define ETH_MAC_ADDRESS0_HIGH                        (ETH_MAC_ADDRESS_G00_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G00_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G00_HIGH.
 */
#define ETH_MAC_ADDRESS0_HIGH                        (ETH_MAC_ADDRESS_G00_HIGH)

/** \\brief  1044, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G00_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E044u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G00_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G00_LOW.
 */
#define ETH_MAC_ADDRESS0_LOW                         (ETH_MAC_ADDRESS_G00_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G00_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G00_LOW.
 */
#define ETH_MAC_ADDRESS0_LOW                         (ETH_MAC_ADDRESS_G00_LOW)

/** \\brief  1090, MAC Address High Register */
#define ETH_MAC_ADDRESS_G010_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E090u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G010_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G010_HIGH.
 */
#define ETH_MAC_ADDRESS10_HIGH                       (ETH_MAC_ADDRESS_G010_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G010_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G010_HIGH.
 */
#define ETH_MAC_ADDRESS10_HIGH                       (ETH_MAC_ADDRESS_G010_HIGH)

/** \\brief  1094, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G010_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E094u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G010_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G010_LOW.
 */
#define ETH_MAC_ADDRESS10_LOW                        (ETH_MAC_ADDRESS_G010_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G010_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G010_LOW.
 */
#define ETH_MAC_ADDRESS10_LOW                        (ETH_MAC_ADDRESS_G010_LOW)

/** \\brief  1098, MAC Address High Register */
#define ETH_MAC_ADDRESS_G011_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E098u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G011_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G011_HIGH.
 */
#define ETH_MAC_ADDRESS11_HIGH                       (ETH_MAC_ADDRESS_G011_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G011_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G011_HIGH.
 */
#define ETH_MAC_ADDRESS11_HIGH                       (ETH_MAC_ADDRESS_G011_HIGH)

/** \\brief  109C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G011_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E09Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G011_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G011_LOW.
 */
#define ETH_MAC_ADDRESS11_LOW                        (ETH_MAC_ADDRESS_G011_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G011_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G011_LOW.
 */
#define ETH_MAC_ADDRESS11_LOW                        (ETH_MAC_ADDRESS_G011_LOW)

/** \\brief  10A0, MAC Address High Register */
#define ETH_MAC_ADDRESS_G012_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E0A0u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G012_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G012_HIGH.
 */
#define ETH_MAC_ADDRESS12_HIGH                       (ETH_MAC_ADDRESS_G012_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G012_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G012_HIGH.
 */
#define ETH_MAC_ADDRESS12_HIGH                       (ETH_MAC_ADDRESS_G012_HIGH)

/** \\brief  10A4, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G012_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E0A4u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G012_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G012_LOW.
 */
#define ETH_MAC_ADDRESS12_LOW                        (ETH_MAC_ADDRESS_G012_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G012_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G012_LOW.
 */
#define ETH_MAC_ADDRESS12_LOW                        (ETH_MAC_ADDRESS_G012_LOW)

/** \\brief  10A8, MAC Address High Register */
#define ETH_MAC_ADDRESS_G013_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E0A8u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G013_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G013_HIGH.
 */
#define ETH_MAC_ADDRESS13_HIGH                       (ETH_MAC_ADDRESS_G013_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G013_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G013_HIGH.
 */
#define ETH_MAC_ADDRESS13_HIGH                       (ETH_MAC_ADDRESS_G013_HIGH)

/** \\brief  10AC, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G013_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E0ACu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G013_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G013_LOW.
 */
#define ETH_MAC_ADDRESS13_LOW                        (ETH_MAC_ADDRESS_G013_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G013_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G013_LOW.
 */
#define ETH_MAC_ADDRESS13_LOW                        (ETH_MAC_ADDRESS_G013_LOW)

