Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** \\brief  1074, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G06_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E074u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G06_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G06_LOW.
 */
#define ETH_MAC_ADDRESS6_LOW                         (ETH_MAC_ADDRESS_G06_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G06_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G06_LOW.
 */
#define ETH_MAC_ADDRESS6_LOW                         (ETH_MAC_ADDRESS_G06_LOW)

/** \\brief  1078, MAC Address High Register */
#define ETH_MAC_ADDRESS_G07_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E078u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G07_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G07_HIGH.
 */
#define ETH_MAC_ADDRESS7_HIGH                        (ETH_MAC_ADDRESS_G07_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G07_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G07_HIGH.
 */
#define ETH_MAC_ADDRESS7_HIGH                        (ETH_MAC_ADDRESS_G07_HIGH)

/** \\brief  107C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G07_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E07Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G07_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G07_LOW.
 */
#define ETH_MAC_ADDRESS7_LOW                         (ETH_MAC_ADDRESS_G07_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G07_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G07_LOW.
 */
#define ETH_MAC_ADDRESS7_LOW                         (ETH_MAC_ADDRESS_G07_LOW)

/** \\brief  1080, MAC Address High Register */
#define ETH_MAC_ADDRESS_G08_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E080u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G08_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G08_HIGH.
 */
#define ETH_MAC_ADDRESS8_HIGH                        (ETH_MAC_ADDRESS_G08_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G08_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G08_HIGH.
 */
#define ETH_MAC_ADDRESS8_HIGH                        (ETH_MAC_ADDRESS_G08_HIGH)

/** \\brief  1084, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G08_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E084u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G08_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G08_LOW.
 */
#define ETH_MAC_ADDRESS8_LOW                         (ETH_MAC_ADDRESS_G08_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G08_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G08_LOW.
 */
#define ETH_MAC_ADDRESS8_LOW                         (ETH_MAC_ADDRESS_G08_LOW)

/** \\brief  1088, MAC Address High Register */
#define ETH_MAC_ADDRESS_G09_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E088u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G09_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G09_HIGH.
 */
#define ETH_MAC_ADDRESS9_HIGH                        (ETH_MAC_ADDRESS_G09_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G09_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G09_HIGH.
 */
#define ETH_MAC_ADDRESS9_HIGH                        (ETH_MAC_ADDRESS_G09_HIGH)

/** \\brief  108C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G09_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E08Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G09_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G09_LOW.
 */
#define ETH_MAC_ADDRESS9_LOW                         (ETH_MAC_ADDRESS_G09_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G09_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G09_LOW.
 */
#define ETH_MAC_ADDRESS9_LOW                         (ETH_MAC_ADDRESS_G09_LOW)

/** \\brief  1800, MAC Address High Register */
#define ETH_MAC_ADDRESS_G10_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E800u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G10_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G10_HIGH.
 */
#define ETH_MAC_ADDRESS16_HIGH                       (ETH_MAC_ADDRESS_G10_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G10_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G10_HIGH.
 */
#define ETH_MAC_ADDRESS16_HIGH                       (ETH_MAC_ADDRESS_G10_HIGH)

/** \\brief  1804, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G10_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E804u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G10_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G10_LOW.
 */
#define ETH_MAC_ADDRESS16_LOW                        (ETH_MAC_ADDRESS_G10_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G10_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G10_LOW.
 */
#define ETH_MAC_ADDRESS16_LOW                        (ETH_MAC_ADDRESS_G10_LOW)

/** \\brief  1850, MAC Address High Register */
#define ETH_MAC_ADDRESS_G110_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E850u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G110_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G110_HIGH.
 */
#define ETH_MAC_ADDRESS26_HIGH                       (ETH_MAC_ADDRESS_G110_HIGH)

