Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G110_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G110_HIGH.
 */
#define ETH_MAC_ADDRESS26_HIGH                       (ETH_MAC_ADDRESS_G110_HIGH)

/** \\brief  1854, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G110_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E854u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G110_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G110_LOW.
 */
#define ETH_MAC_ADDRESS26_LOW                        (ETH_MAC_ADDRESS_G110_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G110_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G110_LOW.
 */
#define ETH_MAC_ADDRESS26_LOW                        (ETH_MAC_ADDRESS_G110_LOW)

/** \\brief  1858, MAC Address High Register */
#define ETH_MAC_ADDRESS_G111_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E858u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G111_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G111_HIGH.
 */
#define ETH_MAC_ADDRESS27_HIGH                       (ETH_MAC_ADDRESS_G111_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G111_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G111_HIGH.
 */
#define ETH_MAC_ADDRESS27_HIGH                       (ETH_MAC_ADDRESS_G111_HIGH)

/** \\brief  185C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G111_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E85Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G111_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G111_LOW.
 */
#define ETH_MAC_ADDRESS27_LOW                        (ETH_MAC_ADDRESS_G111_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G111_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G111_LOW.
 */
#define ETH_MAC_ADDRESS27_LOW                        (ETH_MAC_ADDRESS_G111_LOW)

/** \\brief  1860, MAC Address High Register */
#define ETH_MAC_ADDRESS_G112_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E860u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G112_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G112_HIGH.
 */
#define ETH_MAC_ADDRESS28_HIGH                       (ETH_MAC_ADDRESS_G112_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G112_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G112_HIGH.
 */
#define ETH_MAC_ADDRESS28_HIGH                       (ETH_MAC_ADDRESS_G112_HIGH)

/** \\brief  1864, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G112_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E864u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G112_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G112_LOW.
 */
#define ETH_MAC_ADDRESS28_LOW                        (ETH_MAC_ADDRESS_G112_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G112_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G112_LOW.
 */
#define ETH_MAC_ADDRESS28_LOW                        (ETH_MAC_ADDRESS_G112_LOW)

/** \\brief  1868, MAC Address High Register */
#define ETH_MAC_ADDRESS_G113_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E868u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G113_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G113_HIGH.
 */
#define ETH_MAC_ADDRESS29_HIGH                       (ETH_MAC_ADDRESS_G113_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G113_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G113_HIGH.
 */
#define ETH_MAC_ADDRESS29_HIGH                       (ETH_MAC_ADDRESS_G113_HIGH)

/** \\brief  186C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G113_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E86Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G113_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G113_LOW.
 */
#define ETH_MAC_ADDRESS29_LOW                        (ETH_MAC_ADDRESS_G113_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G113_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G113_LOW.
 */
#define ETH_MAC_ADDRESS29_LOW                        (ETH_MAC_ADDRESS_G113_LOW)

/** \\brief  1870, MAC Address High Register */
#define ETH_MAC_ADDRESS_G114_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E870u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G114_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G114_HIGH.
 */
#define ETH_MAC_ADDRESS30_HIGH                       (ETH_MAC_ADDRESS_G114_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G114_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G114_HIGH.
 */
#define ETH_MAC_ADDRESS30_HIGH                       (ETH_MAC_ADDRESS_G114_HIGH)

/** \\brief  1874, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G114_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E874u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G114_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G114_LOW.
 */
#define ETH_MAC_ADDRESS30_LOW                        (ETH_MAC_ADDRESS_G114_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G114_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G114_LOW.
 */
#define ETH_MAC_ADDRESS30_LOW                        (ETH_MAC_ADDRESS_G114_LOW)

/** \\brief  1878, MAC Address High Register */
#define ETH_MAC_ADDRESS_G115_HIGH                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E878u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G115_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G115_HIGH.
 */
#define ETH_MAC_ADDRESS31_HIGH                       (ETH_MAC_ADDRESS_G115_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G115_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G115_HIGH.
 */
#define ETH_MAC_ADDRESS31_HIGH                       (ETH_MAC_ADDRESS_G115_HIGH)

/** \\brief  187C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G115_LOW                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E87Cu)

