Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G115_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G115_LOW.
 */
#define ETH_MAC_ADDRESS31_LOW                        (ETH_MAC_ADDRESS_G115_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G115_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G115_LOW.
 */
#define ETH_MAC_ADDRESS31_LOW                        (ETH_MAC_ADDRESS_G115_LOW)

/** \\brief  1808, MAC Address High Register */
#define ETH_MAC_ADDRESS_G11_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E808u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G11_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G11_HIGH.
 */
#define ETH_MAC_ADDRESS17_HIGH                       (ETH_MAC_ADDRESS_G11_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G11_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G11_HIGH.
 */
#define ETH_MAC_ADDRESS17_HIGH                       (ETH_MAC_ADDRESS_G11_HIGH)

/** \\brief  180C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G11_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E80Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G11_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G11_LOW.
 */
#define ETH_MAC_ADDRESS17_LOW                        (ETH_MAC_ADDRESS_G11_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G11_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G11_LOW.
 */
#define ETH_MAC_ADDRESS17_LOW                        (ETH_MAC_ADDRESS_G11_LOW)

/** \\brief  1810, MAC Address High Register */
#define ETH_MAC_ADDRESS_G12_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E810u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G12_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G12_HIGH.
 */
#define ETH_MAC_ADDRESS18_HIGH                       (ETH_MAC_ADDRESS_G12_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G12_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G12_HIGH.
 */
#define ETH_MAC_ADDRESS18_HIGH                       (ETH_MAC_ADDRESS_G12_HIGH)

/** \\brief  1814, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G12_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E814u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G12_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G12_LOW.
 */
#define ETH_MAC_ADDRESS18_LOW                        (ETH_MAC_ADDRESS_G12_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G12_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G12_LOW.
 */
#define ETH_MAC_ADDRESS18_LOW                        (ETH_MAC_ADDRESS_G12_LOW)

/** \\brief  1818, MAC Address High Register */
#define ETH_MAC_ADDRESS_G13_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E818u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G13_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G13_HIGH.
 */
#define ETH_MAC_ADDRESS19_HIGH                       (ETH_MAC_ADDRESS_G13_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G13_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G13_HIGH.
 */
#define ETH_MAC_ADDRESS19_HIGH                       (ETH_MAC_ADDRESS_G13_HIGH)

/** \\brief  181C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G13_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E81Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G13_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G13_LOW.
 */
#define ETH_MAC_ADDRESS19_LOW                        (ETH_MAC_ADDRESS_G13_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G13_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G13_LOW.
 */
#define ETH_MAC_ADDRESS19_LOW                        (ETH_MAC_ADDRESS_G13_LOW)

/** \\brief  1820, MAC Address High Register */
#define ETH_MAC_ADDRESS_G14_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E820u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G14_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G14_HIGH.
 */
#define ETH_MAC_ADDRESS20_HIGH                       (ETH_MAC_ADDRESS_G14_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G14_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G14_HIGH.
 */
#define ETH_MAC_ADDRESS20_HIGH                       (ETH_MAC_ADDRESS_G14_HIGH)

/** \\brief  1824, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G14_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E824u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G14_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G14_LOW.
 */
#define ETH_MAC_ADDRESS20_LOW                        (ETH_MAC_ADDRESS_G14_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G14_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G14_LOW.
 */
#define ETH_MAC_ADDRESS20_LOW                        (ETH_MAC_ADDRESS_G14_LOW)

/** \\brief  1828, MAC Address High Register */
#define ETH_MAC_ADDRESS_G15_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E828u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G15_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G15_HIGH.
 */
#define ETH_MAC_ADDRESS21_HIGH                       (ETH_MAC_ADDRESS_G15_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G15_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G15_HIGH.
 */
#define ETH_MAC_ADDRESS21_HIGH                       (ETH_MAC_ADDRESS_G15_HIGH)

/** \\brief  182C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G15_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E82Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G15_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G15_LOW.
 */
#define ETH_MAC_ADDRESS21_LOW                        (ETH_MAC_ADDRESS_G15_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G15_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G15_LOW.
 */
#define ETH_MAC_ADDRESS21_LOW                        (ETH_MAC_ADDRESS_G15_LOW)

