Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** \\brief  1830, MAC Address High Register */
#define ETH_MAC_ADDRESS_G16_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E830u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G16_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G16_HIGH.
 */
#define ETH_MAC_ADDRESS22_HIGH                       (ETH_MAC_ADDRESS_G16_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G16_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G16_HIGH.
 */
#define ETH_MAC_ADDRESS22_HIGH                       (ETH_MAC_ADDRESS_G16_HIGH)

/** \\brief  1834, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G16_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E834u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G16_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G16_LOW.
 */
#define ETH_MAC_ADDRESS22_LOW                        (ETH_MAC_ADDRESS_G16_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G16_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G16_LOW.
 */
#define ETH_MAC_ADDRESS22_LOW                        (ETH_MAC_ADDRESS_G16_LOW)

/** \\brief  1838, MAC Address High Register */
#define ETH_MAC_ADDRESS_G17_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E838u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G17_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G17_HIGH.
 */
#define ETH_MAC_ADDRESS23_HIGH                       (ETH_MAC_ADDRESS_G17_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G17_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G17_HIGH.
 */
#define ETH_MAC_ADDRESS23_HIGH                       (ETH_MAC_ADDRESS_G17_HIGH)

/** \\brief  183C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G17_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E83Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G17_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G17_LOW.
 */
#define ETH_MAC_ADDRESS23_LOW                        (ETH_MAC_ADDRESS_G17_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G17_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G17_LOW.
 */
#define ETH_MAC_ADDRESS23_LOW                        (ETH_MAC_ADDRESS_G17_LOW)

/** \\brief  1840, MAC Address High Register */
#define ETH_MAC_ADDRESS_G18_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E840u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G18_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G18_HIGH.
 */
#define ETH_MAC_ADDRESS24_HIGH                       (ETH_MAC_ADDRESS_G18_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G18_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G18_HIGH.
 */
#define ETH_MAC_ADDRESS24_HIGH                       (ETH_MAC_ADDRESS_G18_HIGH)

/** \\brief  1844, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G18_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E844u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G18_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G18_LOW.
 */
#define ETH_MAC_ADDRESS24_LOW                        (ETH_MAC_ADDRESS_G18_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G18_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G18_LOW.
 */
#define ETH_MAC_ADDRESS24_LOW                        (ETH_MAC_ADDRESS_G18_LOW)

/** \\brief  1848, MAC Address High Register */
#define ETH_MAC_ADDRESS_G19_HIGH                     /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH *)0xF001E848u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G19_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G19_HIGH.
 */
#define ETH_MAC_ADDRESS25_HIGH                       (ETH_MAC_ADDRESS_G19_HIGH)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G19_HIGH.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G19_HIGH.
 */
#define ETH_MAC_ADDRESS25_HIGH                       (ETH_MAC_ADDRESS_G19_HIGH)

/** \\brief  184C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G19_LOW                      /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW *)0xF001E84Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G19_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G19_LOW.
 */
#define ETH_MAC_ADDRESS25_LOW                        (ETH_MAC_ADDRESS_G19_LOW)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G19_LOW.
 * To use register names with standard convension, please use ETH_MAC_ADDRESS_G19_LOW.
 */
#define ETH_MAC_ADDRESS25_LOW                        (ETH_MAC_ADDRESS_G19_LOW)

/** \\brief  1000, Register 0 - MAC Configuration Register */
#define ETH_MAC_CONFIGURATION                        /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_CONFIGURATION *)0xF001E000u)

/** \\brief  1004, Register 1 - MAC Frame Filter */
#define ETH_MAC_FRAME_FILTER                         /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_FRAME_FILTER *)0xF001E004u)

/** \\brief  2020, Register 8 - Missed Frame and Buffer Overflow Counter
 * Register */
#define ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER /*lint --e(923)*/ (*(volatile Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER *)0xF001F020u)

/** \\brief  1100, Register 64 - MMC Control Register */
#define ETH_MMC_CONTROL                              /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_CONTROL *)0xF001E100u)

/** \\brief  1208, Register 130 - MMC Receive Checksum Offload Interrupt
 * Register */
#define ETH_MMC_IPC_RECEIVE_INTERRUPT                /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT *)0xF001E208u)

/** \\brief  1200, Register 128 - MMC Receive Checksum Offload Interrupt Mask
 * Register */
#define ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK           /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK *)0xF001E200u)

/** \\brief  1104, Register 65 - MMC Receive Interrupt Register */
#define ETH_MMC_RECEIVE_INTERRUPT                    /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_RECEIVE_INTERRUPT *)0xF001E104u)

/** \\brief  110C, - */
#define ETH_MMC_RECEIVE_INTERRUPT_MASK               /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK *)0xF001E10Cu)

/** \\brief  1108, Register 66 - MMC Transmit Interrupt Register */
#define ETH_MMC_TRANSMIT_INTERRUPT                   /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_TRANSMIT_INTERRUPT *)0xF001E108u)

/** \\brief  1110, Register 68 - MMC Transmit Interrupt Mask Register */
#define ETH_MMC_TRANSMIT_INTERRUPT_MASK              /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK *)0xF001E110u)

/** \\brief  2018, Register 6 - Operation Mode Register */
#define ETH_OPERATION_MODE                           /*lint --e(923)*/ (*(volatile Ifx_ETH_OPERATION_MODE *)0xF001F018u)

