Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** \\brief  102C, Register 11 - PMT Control and Status Register */
#define ETH_PMT_CONTROL_STATUS                       /*lint --e(923)*/ (*(volatile Ifx_ETH_PMT_CONTROL_STATUS *)0xF001E02Cu)

/** \\brief  172C, Register 459 - PPS Control Register */
#define ETH_PPS_CONTROL                              /*lint --e(923)*/ (*(volatile Ifx_ETH_PPS_CONTROL *)0xF001E72Cu)

/** \\brief  200C, Register 3 - Receive Descriptor List Address Register */
#define ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS          /*lint --e(923)*/ (*(volatile Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS *)0xF001F00Cu)

/** \\brief  2024, Register 9 - Receive Interrupt Watchdog Timer Register */
#define ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER         /*lint --e(923)*/ (*(volatile Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER *)0xF001F024u)

/** \\brief  2008, Register 2 - Receive Poll Demand Register */
#define ETH_RECEIVE_POLL_DEMAND                      /*lint --e(923)*/ (*(volatile Ifx_ETH_RECEIVE_POLL_DEMAND *)0xF001F008u)

/** \\brief  1028, Register 10 - Remote Wake-Up Frame Filter Register */
#define ETH_REMOTE_WAKE_UP_FRAME_FILTER              /*lint --e(923)*/ (*(volatile Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER *)0xF001E028u)

/** \\brief  11C0, Register 112 - Receive Frame Count for Good and Bad 1,024 to
 * Maxsize Bytes Frames */
#define ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD       /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD *)0xF001E1C0u)

/** \\brief  11B4, Register 109 - Receive Frame Count for Good and Bad 128 to
 * 255 Bytes Frames */
#define ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD        /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD *)0xF001E1B4u)

/** \\brief  11B8, Register 110 - Receive Frame Count for Good and Bad 256 to
 * 511 Bytes Frames */
#define ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD        /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD *)0xF001E1B8u)

/** \\brief  11BC, Register 111 - Receive Frame Count for Good and Bad 512 to
 * 1,023 Bytes Frames */
#define ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD       /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD *)0xF001E1BCu)

/** \\brief  11AC, Register 107 - Receive Frame Count for Good and Bad 64 Byte
 * Frames */
#define ETH_RX_64OCTETS_FRAMES_GOOD_BAD              /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD *)0xF001E1ACu)

/** \\brief  11B0, Register 108 - Receive Frame Count for Good and Bad 65 to 127
 * Bytes Frames */
#define ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD         /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD *)0xF001E1B0u)

/** \\brief  1198, Register 102 - Receive Frame Count for Alignment Error Frames */
#define ETH_RX_ALIGNMENT_ERROR_FRAMES                /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES *)0xF001E198u)

/** \\brief  118C, Register 99 - Receive Frame Count for Good Broadcast Frames */
#define ETH_RX_BROADCAST_FRAMES_GOOD                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_BROADCAST_FRAMES_GOOD *)0xF001E18Cu)

/** \\brief  11E4, Register 121 - Receive Frame Count for Good Control Frames
 * Frames */
#define ETH_RX_CONTROL_FRAMES_GOOD                   /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_CONTROL_FRAMES_GOOD *)0xF001E1E4u)

/** \\brief  1194, Register 101 - Receive Frame Count for CRC Error Frames */
#define ETH_RX_CRC_ERROR_FRAMES                      /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_CRC_ERROR_FRAMES *)0xF001E194u)

/** \\brief  11D4, Register 117 - Receive Frame Count for FIFO Overflow Frames */
#define ETH_RX_FIFO_OVERFLOW_FRAMES                  /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES *)0xF001E1D4u)

/** \\brief  1180, Register 96 - Receive Frame Count for Good and Bad Frames */
#define ETH_RX_FRAMES_COUNT_GOOD_BAD                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD *)0xF001E180u)

/** \\brief  11A0, Register 104 - Receive Frame Count for Jabber Error Frames */
#define ETH_RX_JABBER_ERROR_FRAMES                   /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_JABBER_ERROR_FRAMES *)0xF001E1A0u)

/** \\brief  11C8, Register 114 - Receive Frame Count for Length Error Frames */
#define ETH_RX_LENGTH_ERROR_FRAMES                   /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_LENGTH_ERROR_FRAMES *)0xF001E1C8u)

/** \\brief  1190, Register 100 - Receive Frame Count for Good Multicast Frames */
#define ETH_RX_MULTICAST_FRAMES_GOOD                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_MULTICAST_FRAMES_GOOD *)0xF001E190u)

/** \\brief  1188, Register 98 - Receive Octet Count for Good Frames */
#define ETH_RX_OCTET_COUNT_GOOD                      /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_OCTET_COUNT_GOOD *)0xF001E188u)

/** \\brief  1184, Register 97 - Receive Octet Count for Good and Bad Frames */
#define ETH_RX_OCTET_COUNT_GOOD_BAD                  /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD *)0xF001E184u)

/** \\brief  11CC, Register 115 - Receive Frame Count for Out of Range Frames */
#define ETH_RX_OUT_OF_RANGE_TYPE_FRAMES              /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES *)0xF001E1CCu)

/** \\brief  11A8, Register 106 - Receive Frame Count for Oversize Frames */
#define ETH_RX_OVERSIZE_FRAMES_GOOD                  /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD *)0xF001E1A8u)

/** \\brief  11D0, Register 116 - Receive Frame Count for PAUSE Frames */
#define ETH_RX_PAUSE_FRAMES                          /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_PAUSE_FRAMES *)0xF001E1D0u)

/** \\brief  11E0, Register 120 - Receive Frame Count for Receive Error Frames */
#define ETH_RX_RECEIVE_ERROR_FRAMES                  /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_RECEIVE_ERROR_FRAMES *)0xF001E1E0u)

/** \\brief  119C, Register 103 - Receive Frame Count for Runt Error Frames */
#define ETH_RX_RUNT_ERROR_FRAMES                     /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_RUNT_ERROR_FRAMES *)0xF001E19Cu)

