Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** \\brief  11A4, Register 105 - Receive Frame Count for Undersize Frames */
#define ETH_RX_UNDERSIZE_FRAMES_GOOD                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD *)0xF001E1A4u)

/** \\brief  11C4, Register 113 - Receive Frame Count for Good Unicast Frames */
#define ETH_RX_UNICAST_FRAMES_GOOD                   /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_UNICAST_FRAMES_GOOD *)0xF001E1C4u)

/** \\brief  11D8, Register 118 - Receive Frame Count for Good and Bad VLAN
 * Frames */
#define ETH_RX_VLAN_FRAMES_GOOD_BAD                  /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD *)0xF001E1D8u)

/** \\brief  11DC, Register 119 - Receive Frame Count for Watchdog Error Frames */
#define ETH_RX_WATCHDOG_ERROR_FRAMES                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES *)0xF001E1DCu)

/** \\brief  1244, Register 145 - Receive ICMP Error Frame Counter Register */
#define ETH_RXICMP_ERROR_FRAMES                      /*lint --e(923)*/ (*(volatile Ifx_ETH_RXICMP_ERROR_FRAMES *)0xF001E244u)

/** \\brief  1284, Register 161 - Receive ICMP Error Octet Counter Register */
#define ETH_RXICMP_ERROR_OCTETS                      /*lint --e(923)*/ (*(volatile Ifx_ETH_RXICMP_ERROR_OCTETS *)0xF001E284u)

/** \\brief  1240, Register 144 - Receive ICMP Good Frame Counter Register */
#define ETH_RXICMP_GOOD_FRAMES                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXICMP_GOOD_FRAMES *)0xF001E240u)

/** \\brief  1280, Register 160 - Receive ICMP Good Octet Counter Register */
#define ETH_RXICMP_GOOD_OCTETS                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXICMP_GOOD_OCTETS *)0xF001E280u)

/** \\brief  121C, Register 135 - Receive IPV4 Fragmented Frame Counter Register */
#define ETH_RXIPV4_FRAGMENTED_FRAMES                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES *)0xF001E21Cu)

/** \\brief  125C, Register 151 - Receive IPV4 Fragmented Octet Counter Register */
#define ETH_RXIPV4_FRAGMENTED_OCTETS                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS *)0xF001E25Cu)

/** \\brief  1210, Register 132 - Receive IPV4 Good Frame Counter Register */
#define ETH_RXIPV4_GOOD_FRAMES                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_GOOD_FRAMES *)0xF001E210u)

/** \\brief  1250, Register 148 - Receive IPV4 Good Octet Counter Register */
#define ETH_RXIPV4_GOOD_OCTETS                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_GOOD_OCTETS *)0xF001E250u)

/** \\brief  1214, Register 133 - Receive IPV4 Header Error Frame Counter
 * Register */
#define ETH_RXIPV4_HEADER_ERROR_FRAMES               /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES *)0xF001E214u)

/** \\brief  1254, Register 149 - Receive IPV4 Header Error Octet Counter
 * Register */
#define ETH_RXIPV4_HEADER_ERROR_OCTETS               /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS *)0xF001E254u)

/** \\brief  1218, Register 134 - Receive IPV4 No Payload Frame Counter Register */
#define ETH_RXIPV4_NO_PAYLOAD_FRAMES                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES *)0xF001E218u)

/** \\brief  1258, Register 150 - Receive IPV4 No Payload Octet Counter Register */
#define ETH_RXIPV4_NO_PAYLOAD_OCTETS                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS *)0xF001E258u)

/** \\brief  1260, Register 152 - Receive IPV4 Fragmented Octet Counter Register */
#define ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS *)0xF001E260u)

/** \\brief  1220, Register 136 - Receive IPV4 UDP Checksum Disabled Frame
 * Counter Register */
#define ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES      /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES *)0xF001E220u)

/** \\brief  1224, Register 137 - Receive IPV6 Good Frame Counter Register */
#define ETH_RXIPV6_GOOD_FRAMES                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV6_GOOD_FRAMES *)0xF001E224u)

/** \\brief  1264, Register 153 - Receive IPV6 Good Octet Counter Register */
#define ETH_RXIPV6_GOOD_OCTETS                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV6_GOOD_OCTETS *)0xF001E264u)

/** \\brief  1228, Register 138 - Receive IPV6 Header Error Frame Counter
 * Register */
#define ETH_RXIPV6_HEADER_ERROR_FRAMES               /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES *)0xF001E228u)

/** \\brief  1268, Register 154 - Receive IPV6 Header Error Octet Counter
 * Register */
#define ETH_RXIPV6_HEADER_ERROR_OCTETS               /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS *)0xF001E268u)

/** \\brief  122C, Register 139 - Receive IPV6 No Payload Frame Counter Register */
#define ETH_RXIPV6_NO_PAYLOAD_FRAMES                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES *)0xF001E22Cu)

/** \\brief  126C, Register 155 - Receive IPV6 No Payload Octet Counter Register */
#define ETH_RXIPV6_NO_PAYLOAD_OCTETS                 /*lint --e(923)*/ (*(volatile Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS *)0xF001E26Cu)

/** \\brief  123C, Register 143 - Receive TCP Error Frame Counter Register */
#define ETH_RXTCP_ERROR_FRAMES                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXTCP_ERROR_FRAMES *)0xF001E23Cu)

/** \\brief  127C, Register 159 - Receive TCP Error Octet Counter Register */
#define ETH_RXTCP_ERROR_OCTETS                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXTCP_ERROR_OCTETS *)0xF001E27Cu)

/** \\brief  1238, Register 142 - Receive TCP Good Frame Counter Register */
#define ETH_RXTCP_GOOD_FRAMES                        /*lint --e(923)*/ (*(volatile Ifx_ETH_RXTCP_GOOD_FRAMES *)0xF001E238u)

/** \\brief  1278, Register 158 - Receive TCP Good Octet Counter Register */
#define ETH_RXTCP_GOOD_OCTETS                        /*lint --e(923)*/ (*(volatile Ifx_ETH_RXTCP_GOOD_OCTETS *)0xF001E278u)

/** \\brief  1234, Register 141 - Receive UDP Error Frame Counter Register */
#define ETH_RXUDP_ERROR_FRAMES                       /*lint --e(923)*/ (*(volatile Ifx_ETH_RXUDP_ERROR_FRAMES *)0xF001E234u)

