Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_reg.h
/** \\brief  1118, Register 70 - Transmit Frame Count for Good and Bad Frames */
#define ETH_TX_FRAME_COUNT_GOOD_BAD                  /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD *)0xF001E118u)

/** \\brief  1158, Register 86 - Transmit Frame Count for Late Collision Error
 * Frames */
#define ETH_TX_LATE_COLLISION_FRAMES                 /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_LATE_COLLISION_FRAMES *)0xF001E158u)

/** \\brief  1120, Register 72 - Transmit Frame Count for Good Multicast Frames */
#define ETH_TX_MULTICAST_FRAMES_GOOD                 /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_MULTICAST_FRAMES_GOOD *)0xF001E120u)

/** \\brief  1140, Register 80 - Transmit Frame Count for Good and Bad Multicast
 * Frames */
#define ETH_TX_MULTICAST_FRAMES_GOOD_BAD             /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD *)0xF001E140u)

/** \\brief  1150, Register 84 - Transmit Frame Count for Frames Transmitted
 * after Multiple Collision */
#define ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES        /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES *)0xF001E150u)

/** \\brief  1164, Register 89 - Transmit Octet Count for Good Frames */
#define ETH_TX_OCTET_COUNT_GOOD                      /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_OCTET_COUNT_GOOD *)0xF001E164u)

/** \\brief  1114, Register 69 - Transmit Octet Count for Good and Bad Frames */
#define ETH_TX_OCTET_COUNT_GOOD_BAD                  /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD *)0xF001E114u)

/** \\brief  1178, Register 94 - Transmit Frame Count for Good Oversize Frames */
#define ETH_TX_OSIZE_FRAMES_GOOD                     /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_OSIZE_FRAMES_GOOD *)0xF001E178u)

/** \\brief  1170, Register 92 - Transmit Frame Count for Good PAUSE Frames */
#define ETH_TX_PAUSE_FRAMES                          /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_PAUSE_FRAMES *)0xF001E170u)

/** \\brief  114C, Register 83 - Transmit Frame Count for Frames Transmitted
 * after Single Collision */
#define ETH_TX_SINGLE_COLLISION_GOOD_FRAMES          /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES *)0xF001E14Cu)

/** \\brief  1148, Register 82 - Transmit Frame Count for Underflow Error Frames */
#define ETH_TX_UNDERFLOW_ERROR_FRAMES                /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES *)0xF001E148u)

/** \\brief  113C, Register 79 - Transmit Frame Count for Good and Bad Unicast
 * Frames */
#define ETH_TX_UNICAST_FRAMES_GOOD_BAD               /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD *)0xF001E13Cu)

/** \\brief  1174, Register 93 - Transmit Frame Count for Good VLAN Frames */
#define ETH_TX_VLAN_FRAMES_GOOD                      /*lint --e(923)*/ (*(volatile Ifx_ETH_TX_VLAN_FRAMES_GOOD *)0xF001E174u)

/** \\brief  1020, Register 8 - Version Register */
#define ETH_VERSION                                  /*lint --e(923)*/ (*(volatile Ifx_ETH_VERSION *)0xF001E020u)

/** \\brief  101C, Register 7 - VLAN Tag Register */
#define ETH_VLAN_TAG                                 /*lint --e(923)*/ (*(volatile Ifx_ETH_VLAN_TAG *)0xF001E01Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXETH_REG_H */
